note/2019/display-console-in-emacs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-04 Tue 00:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Display console in Emacs</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Yuan Fu" />
<link rel="stylesheet" type="text/css" href="../../style.css"/>
<link rel="icon" type="image/png" href="../../../favicon.png">
</head>
<body>
<div id="org-div-home-and-up-index-page">
<div>
<a accesskey="h" href="../../index.html"> UP </a> |
<a accesskey="H" href="../../index.html"> HOME </a>
</div>
<div>
<a href="../rss.xml"> RSS </a> |
<a href="https://github.com/casouri/casouri.github.io"> Source </a> |
<a href="https://creativecommons.org/licenses/by-sa/4.0/"> License </a>
</div>
</div><div id="content">
<h1 class="title">Display console in Emacs</h1>
<p>
When editing source, let it be source code or Tex source, we usually need another session for interactive operations like shell, REPL, compile log, etc.
</p>

<p>
I want the interactive session to be associated with the source and can easily switch on and off. The result is two function: <code>toggle-console-buffer</code> and <code>toggle-console-window</code>.
</p>

<p>
I primarily work on my laptop with only one window displayed. So normally I just switch between source buffer and the console buffer (the interactive session) by <code>toggle-console-buffer</code>. In other time, I want to see the update in console buffer while working in source buffer. <code>toggle-console-window</code> switches on a dedicated window<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> on the bottom. The clever thing is, when this window is live, <code>toggle-console-buffer</code> doesn’t switch to console buffer in the main window, but jumps to the console window at the bottom.
</p>

<p>
Here is the code:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #e45649;">defvar</span> <span style="color: #6a1868;">luna-console-buffer-alist</span> '((emacs-lisp-mode . <span style="color: #50a14f;">"*scratch*"</span>))
  <span style="color: #9ca0a4; font-style: italic;">"An alist with element (major-mode . console buffer)."</span>)

(<span style="color: #e45649;">defvar-local</span> <span style="color: #6a1868;">luna-console-buffer-p</span> nil
  <span style="color: #9ca0a4; font-style: italic;">"T if this buffer is a console buffer."</span>)

(<span style="color: #e45649;">defun</span> <span style="color: #a626a4;">luna--get-console-buffer</span> (major-mode)
  <span style="color: #9ca0a4; font-style: italic;">"Return the console buffer corresponding to MAJOR-MODE.</span>
<span style="color: #9ca0a4; font-style: italic;">Return nil if none exists."</span>
  (<span style="color: #e45649;">if-let</span> ((console-buffer (alist-get major-mode luna-console-buffer-alist)))
      console-buffer
    (message <span style="color: #50a14f;">"No console buffer, use `</span><span style="color: #b751b6;">luna-set-console-buffer</span><span style="color: #50a14f;">' to set one"</span>)
    nil))

(<span style="color: #e45649;">defun</span> <span style="color: #a626a4;">luna-toggle-console</span> ()
  <span style="color: #9ca0a4; font-style: italic;">"Toggle display of console buffer.</span>
<span style="color: #9ca0a4; font-style: italic;">When console window is live, jump between console window and previous window;</span>
<span style="color: #9ca0a4; font-style: italic;">when console window is not live, switch between console buffer and previous buffer."</span>
  (<span style="color: #e45649;">interactive</span>)
  (<span style="color: #e45649;">if</span> (window-live-p luna-console-window)
      <span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">jump between console window and previous window</span>
      (<span style="color: #e45649;">if</span> luna-console-buffer-p
          (<span style="color: #e45649;">if-let</span> ((win (window-parameter luna-console-window 'luna-console-jump-back)))
              (select-window win)
            (select-window (previous-window))
            (message <span style="color: #50a14f;">"Could not find previous window, guess one"</span>))
        (<span style="color: #e45649;">let</span> ((old-window (selected-window)))
          (select-window luna-console-window)
          (set-window-parameter nil 'luna-console-jump-back old-window)))
    <span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">switch between console buffer and previous buffer</span>
    (<span style="color: #e45649;">if</span> luna-console-buffer-p
        (previous-buffer)
      (switch-to-buffer (luna--get-console-buffer major-mode))
      (<span style="color: #e45649;">setq-local</span> luna-console-buffer-p t))))

(<span style="color: #e45649;">defun</span> <span style="color: #a626a4;">luna-set-console-buffer</span> (buffer)
  <span style="color: #9ca0a4; font-style: italic;">"Set current console buffer to BUFFER."</span>
  (<span style="color: #e45649;">interactive</span> <span style="color: #50a14f;">"b"</span>)
  (<span style="color: #e45649;">setf</span> (alist-get major-mode luna-console-buffer-alist)
        (get-buffer buffer)))

(<span style="color: #e45649;">defvar</span> <span style="color: #6a1868;">luna-console-window</span> nil
  <span style="color: #9ca0a4; font-style: italic;">"A window at bottom dedicated to console buffer."</span>)

(<span style="color: #e45649;">defun</span> <span style="color: #a626a4;">luna-toggle-console-window</span> ()
  <span style="color: #9ca0a4; font-style: italic;">"Toggle display of console window."</span>
  (<span style="color: #e45649;">interactive</span>)
  (<span style="color: #e45649;">if</span> (window-live-p luna-console-window)
      (delete-window luna-console-window)
    (<span style="color: #e45649;">when-let</span> ((buf (luna--get-console-buffer major-mode)))
      (<span style="color: #e45649;">setq</span> luna-console-window
            (display-buffer-at-bottom (get-buffer buf) '((window-height . 0.2)))))))
</pre>
</div>

<p>
Some note:
</p>
<ul class="org-ul">
<li>I associate the major mode of source to a single console buffer (or the buffer name). Add new associations by pushing new key-value pair to the alist:</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'luna-console-buffer-alist '(haskell-mode . <span style="color: #50a14f;">"*haskell*"</span>))
</pre>
</div>
<ul class="org-ul">
<li>I never use multiple frames so the above code needs adjustment to work with that. For example, <code>luna-console-window</code> should probably be a frame parameter.</li>
</ul>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
I didn’t use <code>set-window-dedicated-p</code> so it’s not really dedicated.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Written by Yuan Fu <<a href="mailto:casouri@gmail.com">casouri@gmail.com</a>></p>
<p class="first-publish">First Published on 2019-08-02 Fri 19:08</p>
<p class-"last-modified">Last modified on 2020-02-03 Mon 23:01</p>
</div>
</body>
</html>
